Documents/урскУстановкаСнятиеЕдиницОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>урскУстановкаСнятиеЕдиницОборудования</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.урскЕдиницыОборудованияНаТехническихМестах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЕдиницаОборудования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.урскЕдиницыОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТехническоеМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.урскВидыОрганизационныхОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.урскВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/урскЕдиницыОборудованияНаТехническихМестах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>урскЕдиницыОборудованияНаТехническихМестах</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЕдиницыОборудования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.урскЕдиницыОборудования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТехническоеМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.урскСтруктурыСети</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.урскВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/урскУстановкаСнятиеЕдиницОборудования/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим) 
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр урскЕдиницыОборудованияНаТехническихМестах
	Движения.урскЕдиницыОборудованияНаТехническихМестах.Записывать = Истина;
	Движение = Движения.урскЕдиницыОборудованияНаТехническихМестах.Добавить();
	Движение.Период = Дата;
	Движение.ТехническоеМесто = ТехническоеМесто;
	Движение.Статус = ВидОперации;
	Движение.ЕдиницыОборудования = ЕдиницаОборудования;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
